package com.nexign.gpn.qa.learn.java.dataprovider;

import org.testng.annotations.DataProvider;

public class RegExpDataProvider {

    @DataProvider
    public Object[][] findPhoneNumber() {
        return new Object[][]{
                {"В любой непонятной ситуации звони 800 555 353-5", "+7(800)555-35-35"},
                {"Сменил номер с 8(800)5553535 на кредитку", "+7(800)555-35-35"},
                {"Сменил номер с 88005553535 на кредитку", "+7(800)555-35-35"},
                {"8005553535 больше не звоню теперь только 911", "+7(800)555-35-35"},
                {"(800)555,35,35 -а вдруг и так тоже то-то пишет", "+7(800)555-35-35"},
                {"+79525553535 -не всё же с 8", "+7(952)555-35-35"},
                {"не забываем про мегафон: +73125553535", "+7(312)555-35-35"},
                {"Ну а вот так +7312555 телефон уже не пишут 3535", ""},
                {"этот номер не российский +51234567898 в отличии от этого +7(812)999-8-999'", "+7(812)999-89-99"},
        };
    }

}
